# Importando as bibliotecas necessarias

In [19]:
import pandas as pd

In [20]:
df=pd.read_csv("/Users/chenyenpin/Downloads/Airplane_Crashes_and_Fatalities_Since_1908.csv", usecols=["Date", "Fatalities"])
df.head()

         Date  Fatalities
0  09/17/1908         1.0
1  07/12/1912         5.0
2  08/06/1913         1.0
3  09/09/1913        14.0
4  10/17/1913        30.0

Analisando qual o tipo de dados que é "Date"

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5268 entries, 0 to 5267
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        5268 non-null   object
 1   Fatalities  5256 non-null   float64
dtypes: float64(1), object(1)
memory usage: 82.4+ KB

In [22]:
#transformando para datetime e substituicao para formatacao padrao
pd.to_datetime(df["Date"])

0      1908-09-17
1      1912-07-12
2      1913-08-06
3      1913-09-09
4      1913-10-17
          ...
5263   2009-05-20
5264   2009-05-26
5265   2009-06-01
5266   2009-06-07
5267   2009-06-08
Name: Date, Length: 5268, dtype: datetime64[ns]

Usando a funcao .astype() facilita caso precisamos passar mais de 1 coluna para data

In [23]:
df["Date"].astype("datetime64[ns]")

0      1908-09-17
1      1912-07-12
2      1913-08-06
3      1913-09-09
4      1913-10-17
          ...
5263   2009-05-20
5264   2009-05-26
5265   2009-06-01
5266   2009-06-07
5267   2009-06-08
Name: Date, Length: 5268, dtype: datetime64[ns]

In [24]:
df.head(1)

         Date  Fatalities
0  09/17/1908         1.0

Podemos passar tambem o parametro format para informar como esta o formato da nossa data para evitar que o pandas nao tenha o entendimento inadequado entre os dias e meses.

In [25]:
pd.to_datetime(df["Date"], format="%m/%d/%Y")

0      1908-09-17
1      1912-07-12
2      1913-08-06
3      1913-09-09
4      1913-10-17
          ...
5263   2009-05-20
5264   2009-05-26
5265   2009-06-01
5266   2009-06-07
5267   2009-06-08
Name: Date, Length: 5268, dtype: datetime64[ns]

Passando o parametro "parse_date" diretamente quando vamos ler o nosso arquivo, nesse caso ele transforma a nossa diretamente para formato DATETIME

In [26]:
df1=pd.read_csv("/Users/chenyenpin/Downloads/Airplane_Crashes_and_Fatalities_Since_1908.csv", parse_dates=["Date"], usecols=["Date", "Fatalities"])
df1.head()

        Date  Fatalities
0 1908-09-17         1.0
1 1912-07-12         5.0
2 1913-08-06         1.0
3 1913-09-09        14.0
4 1913-10-17        30.0

In [27]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5268 entries, 0 to 5267
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        5268 non-null   datetime64[ns]
 1   Fatalities  5256 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 82.4 KB

Apos transformado a nossa coluna para data, podemos ter varias funcoes atribuidos a ela, tais como nome do dia da semana, trimestre etc

In [28]:
#passando a funcao quarter para determinar em qual trimestre a data se encontra.
df1["Quarter"]=df1["Date"].dt.quarter
df1.head()

        Date  Fatalities  Quarter
0 1908-09-17         1.0        3
1 1912-07-12         5.0        3
2 1913-08-06         1.0        3
3 1913-09-09        14.0        3
4 1913-10-17        30.0        4

Transformando a coluna data para index

In [29]:
df1_index=df1.set_index("Date")

df1_index.index.dtype

dtype('<M8[ns]')

In [30]:
df1_index.drop(columns="Quarter", inplace=True)

Somando fatalidades no mes

In [31]:
df1_index.resample("MS").sum()

            Fatalities
Date
1908-09-01         1.0
1908-10-01         0.0
1908-11-01         0.0
1908-12-01         0.0
1909-01-01         0.0
...                ...
2009-02-01       102.0
2009-03-01        44.0
2009-04-01        65.0
2009-05-01       120.0
2009-06-01       242.0

[1210 rows x 1 columns]

Agrupando por  media por semana

In [32]:
df1_index.resample("W").mean()

            Fatalities
Date
1908-09-20         1.0
1908-09-27         NaN
1908-10-04         NaN
1908-10-11         NaN
1908-10-18         NaN
...                ...
2009-05-17         NaN
2009-05-24        98.0
2009-05-31         4.0
2009-06-07       114.5
2009-06-14        13.0

[5257 rows x 1 columns]

Usando rolling para "rolar" meses a frente

In [33]:
df1_index.rolling(2).mean()

            Fatalities
Date
1908-09-17         NaN
1912-07-12         3.0
1913-08-06         3.0
1913-09-09         7.5
1913-10-17        22.0
...                ...
2009-05-20        58.0
2009-05-26        51.0
2009-06-01       116.0
2009-06-07       114.5
2009-06-08         7.0

[5268 rows x 1 columns]

ou podemos utilizar o expanding para calcularmos o acumulado

In [34]:
df1_index.expanding().sum()

            Fatalities
Date
1908-09-17         1.0
1912-07-12         6.0
1913-08-06         7.0
1913-09-09        21.0
1913-10-17        51.0
...                ...
2009-05-20    105233.0
2009-05-26    105237.0
2009-06-01    105465.0
2009-06-07    105466.0
2009-06-08    105479.0

[5268 rows x 1 columns]